nc: 80  # number of classes
depth_multiple: 0.33  # model depth scaling factor
width_multiple: 0.25  # layer channel scaling factor

# Backbone configuration
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 6, BottleneckCSP, [1024]],
  ]

# Head configuration
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [512]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [256]],
   [-1, 1, Conv, [128, 1, 1]],
   [[-1, 3], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [64, 1, 1]],
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [64]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [256]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [512]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],
   [-1, 3, BottleneckCSP, [1024]],
   [[-1, 2], 1, Concat, [1]],
   [-1, 1, Conv, [nc, 1, 1]],
  ]